Abstract: The purpose of this study is to analyse Kashi’s development as a civilization. The locals of Kashi make a point of telling visitors that the city has been around since the beginning of time, hence the city's continued use of the old name Kashi. The ancient Indians of Kashi greatly enjoyed having visitors. The city of Varanasi represents a complex mix of the cosmic structure and local sacrality, and has grown without the support of sacred kingship. There are mentions to different goddesses in Kashi Khanda of 8th century; however, only some of these goddesses still exist today, with the remainder having amalgamated that remain and being invoked in ceremonies under different names. Formerly known as Kashi, the city now known as Varanasi is one of the oldest continuously inhabited cities in the world. Likewise, the cultural activities, civilizations, schools, and temples of Kashi are defined by this study.
Keywords: culture, Kashi khanda, Indian, medieval period, Kashi.
Introduction
Kashi, today known as Varanasi, was once a holy city and is among the world's oldest
continuously inhabited locations. People often use metaphors such as "a city bathed with divine
light" or "a small world" to describe Kashi. "Rome, the Eternal City" (Sadguru, Kashi). Hindu
deity Shiva, also known is Vishwanath, lives there in perpetuity. Because of its significance as a religious location for followers of Hinduism, Buddhism, and Jainism, it is a popular tourist
attraction. Kashi has long been the overseer of old and of modern Indian culture, which drew inspiration from a wide range of religious and philosophical views. Varanasi's history is more than simply a record on politics; it is also a record of a culture through which the full philosophy for Indianness is presented. This is because of the city's religious, academic, and commercial  significance. Many fascinating resources have been used to highlight various features of city life. There is no other work by its subject except from this one. This book, named "Kashi ka Itihasa," is a book that throws light upon the history of the place. The author, Shri Motichandra ji, is a respected academician and his ancestor was the Kashi native Shri Bharatendu Harishchandra ji. He has satisfied the city's debt to him by writing this comprehensive history. Many such Indian writers were masters in spreading the name of their major cities.
Several other scripts paid homage to the Sarvadesh Bhasha script, including those of India,
Nepal, and Bangladesh. The practise of travelling to major cities for the sake of worship was
prevalent. Prior to the onset of the rainy season, the land shift made it possible for pilgrims to
walk across the river at various locations. Ganga basin religious landmarks like the Kashi
Vishwanath temple and the Sankat Mochan temple attest to the region's storied cultural and
spiritual diversity (Tripathi et al., 1984).
A Brief History of Kashi
For a very long time, the area in Varanasi (Kashi) has served as the holiest of Hindu pilgrimage
sites. Hindus believe that if they die in the holy city of Varanasi, they would be saved and
released from the endless cycle of reincarnation. Varanasi, the Hindu holy city where Shiva and Parvati are believed to live, has mysterious origins. It is widely held that the waters of the
Ganges River in Varanasi can cleanse one of their earthly transgressions. Hindus believe that if they die in the holy city of Varanasi, they would be saved and released from the endless cycle of reincarnation. Varanasi (or Benares, Banaras, Kashi), on the left bank of the Ganges, is one of the seven sacred cities of the Hindus. Among the oldest continuously inhabited cities in the
world, its early history is that of the first Aryan settlement in the middle Ganges valley. By late
2nd millennium BCE, Varanasi was a seat of Aryan religion and philosophy and a commercial
and industrial centre famous for its muslin and silk fabrics, perfumes, ivory works, and sculpture. The capital of the kingdom of Kashi during the time of the Buddha (6th century BCE), who gave his first sermon at nearby Sarnath, it remained a centre of religious, educational, and artistic activities as attested by the celebrated Chinese traveler Hsüan-tsang, who visited it in c. 635 CE and said that the city extended for about 5 km along the western bank of the Ganges. Varanasi has the finest [religious] river frontage in India, with miles of ghats (steps) for bathing; an array of shrines, temples, and palaces rises tier on tier from the bank. More than a million pilgrims visit each year; many hope to die there in old age. A center of Hindu learning through the ages, it has lots of schools and countless Brahmin pandits. Its three universities include the large and important Banaras Hindu University (1915) and over a dozen colleges. A centre of arts, crafts, music and dance, it is also famous for its production of silks and brocades with gold and silver thread work, as well as for wooden toys, bangles made of glass, ivory work, and brassware. The land of Varanasi (Kashi) has been the ultimate pilgrimage spot for Hindus for ages. Hindus believe that one who is graced to die on the land of Varanasi would attain salvation and freedom from the cycle of birth and re-birth. Abode of Lord Shiva and Parvati, the origins of Varanasi are yet unknown. Ganges in Varanasi is believed  to have the power to wash away the sins of mortals.
Varanasi has also been a great centre of learning for ages. Varanasi is associated with promotion of spiritualism, mysticism, Sanskrit,  yoga and Hindi language and honored authors such as the ever-famous novelist Prem Chand and Tulsi Das, the famous saint-poet who wrote Ram Charit Manas. Aptly called as the cultural capital of India, Varanasi has provided the right platform for all cultural activities to flourish. Many exponents of dance and music have come from Varanasi. Ravi Shankar, the internationally renowned Sitar maestro and Ustad Bismillah Khan, (the famous Shehnai player) are all sons of the blessed city or have lived here for major part of their lives.Varanasi is one of the oldest continuously inhabited cities in the world. It was one of the first major urban settlements in the middle Ganges valley.
It was the capital of the kingdom of Kashi during the time of the Buddha (6th century BCE), who gave his first sermon nearby at Sarnath. Varanasi remained a centre of religious, educational, and artistic activities as attested by the celebrated Chinese Buddhist pilgrim Xuanzang, who visited it about 635 CE and said that the city extended for about 3 miles (5 km) along the western bank of the Ganges.
Varanasi subsequently declined during three centuries of Muslim occupation, beginning in 1194. Many of the city’s Hindu temples were destroyed during the period of Muslim rule, and learned scholars fled to other parts of the country. The Mughal emperor Akbar in the 16th century brought some relief to the city’s religious and cultural activities. There was another setback during the reign of the Mughal emperor Aurangzeb in the late 17th century, but later the Marathas sponsored a new revival. Varanasi became an independent kingdom in the 18th century, and under the subsequent British rule it remained a commercial and religious centre.
In 1910 the British made Varanasi a new Indian state, with Ramnagar (on the opposite bank) as headquarters but with no jurisdiction over the city of Varanasi. In 1947, after Indian independence, the Varanasi state became part of the state of Uttar Pradesh.
Cultural Events in kashi
Rangabhari Ekadashi is observed on Phalgun Shukla ekadashi. Baba Vishwanath is said to return to Kashi with a cow, mother Bhagwati, in tow just before Holi. Dozens of Damroos can be heard throughout the temple complex. Over 200 years have passed since this ritual was first carried out. Parvati and Shiva are said to have left with Basant Panchami, Shivaratri, and Rangbhari Ekadashi, respectively, to celebrate their wedding and the departure of Parvati on their wedding [7]. The temple's original Mahant family has been upholding these rituals for well over a century [8]. These portions of Baba's wedding ceremony take place at the home of Kulpati Tiwari, a former Mahant of the Lord Kashi Vishwanath Temple at Redzone [9]. Baba Vishwanath chanted the Saptarishi Aarti, a set of seven mantras and chants. According to Puranas, the Saptarishi is particularly fond of the priest in Kashi, hence it is customary for followers of the Saptarishi Aarti to preside over wedding ceremonies. Vedic rites were performed by a group of seven priests known as archaks, led by Pradhan Archak Pandit Shashibhushan Tripathi (Guddu Maharaj) [10].
Temples in Kashi
"The Ganga, Shiva, & Kashi: when this trio is attentive, little surprise there is discovered the
kindness which leads on to perfect happiness or salvation," it says in Skanda- Purana
(Kashi Khand), an old scripture. It is known as the metropolis of great religious buildings of
many different faiths. Located on the banks of the Ganges, the holy city is home to countless
temples, monasteries, and other places of worship frequented by people from many areas of life and regions of the country. According to the prominent Indologist, "hardly any city on India earth which could claim more antiquity, better continuity, or greater popular adoration than Kashi" when referring to Kashi. The city of Kashi has been revered as a religious centre for at least the past three decades. Kashi is the only city in India that causes Hindus to feel such intense religious fervor. As represented by its many temples, Kashi is widely regarded as the spiritual centre of the world. It is widely believed that Lord Shiva, as the supreme deity of Hinduism, resides in Kashi. After being banished by King Divodasa of Kashi, Lord Shiva and the other Lords are mentioned in the longing to return to their former home of Kashi. In order to reenter Kashi, Lord Shiva dispatched his Ganas and gods. In some Puranas, the gods of this area are given central billing through the telling of this event. Kashi also has a history of adopting (through punarsthapana) central Hindu Indian religious practices. Consequently, Kashi is home to all four Dhamas, all twelve Jyotirlingas, all fifty-six Vinayakas, all eight Bhairavas, all nine Gauris, all nine Durgas, all nine grahas, all ten incarnations, all twelve Adityas, all thirtee Narshimhas, all sixteen Keshvas, and all sixty-four Yoginis (Chandramaui, 2006). A total of 42 Vishnu Pithas are mentioned in the Kashi Khanda. Among the oldest is the Adi Keshava Temple. An ADI KESHAVA TEMPLE is situated at the meeting point of the rivers Varuna and Ganga. It is said that Lord Vishnu, at Shiva's bidding, first stepped foot in Kashi, cleaned his foot, and then left his footprint here in Kashi. Since then, this temple has stood here. Matsya Purana mentions both the Bindumadhava Temple and the AdiKeshva Temple at PanchgangaGhat, while the Chaukhambha GopalMandir is listed as well (Sukul K.N, 1974).
Many Surya devta temples can be seen in Kashi. In the holy city of Varanasi, the Hindu sun god Surya is primarily honoured in twelve different guises: Arun Aditya, Drupad Aditya, Ganga Aditya, and so on. Adityas like Keshava, Kakholkh, Lolark, Mayukh, Sambha, and so on. Kashi is sometimes referred to as the "City of Temples" because to the stunning amount of religious buildings there. The Saptasarga Mandir, the Jagannatha Temple (AsiGhat), the Patanjali Mandir, the Swami Narayan Mandir (Matsyodari Park), the Radha Swami Mandir, the Sisevala Mandir, the SatyaSaiMandir (Ravindrapuri), the two temples dedicated to Kabir, the two temples dedicated to Rai Das (at Rajghtat) etc. According to studies conducted for the book "Temples in Kashi," Varanasi has one of the biggest concentrations of both ancient and modern temples. Over a thousand temples testify to Varanasi's long history and the city's religious significance to Hindus and other faiths. The Kashi Vishvanath Temple, the Sankat Mochan Temple, the Durga Temple, the Kal Bhairav Temple, the Mrityunjaya Temple, the Bharat Mata Temple, the Chinese Temple, etc. are only a few of the city's most well-known religious landmarks.
Concept of Civilization in present day- Varanasi
Kashi, India, has grown both in size and population. At around 28.5 square miles, the metro area is significantly larger than most American cities. There is an average of 72 people living in every square acre, making it one of India's densest urban areas (1951 Census). The city's population in 1971 was 5, 88,608. In 1951, there were roughly 43,865 homes within the city limits; today, that number has risen to far over 45,000.
In the major eulogy Sanskrit text of Kāshi, the Kāshi Khand, the virtuous King Divodāsa made Kāshi the capital of his kingdom after Shiva and all the Devas had left the city. Eventually Shiva and his wife Pārvati, who lived in the mountains, no longer wanted to live away from their homely abode Kāshi. But it was difficult to attack such a flawless king. Shiva realised: only when King Divodāsa would fall, he and other gods would get resort in the ordered and  holy city of Kāshi. So in order to create a crisis in the city and dislodge Divodāsa from Kāshi Shiva sent sixty-four Yoginis (“assisting goddesses”) who entered the city. Being thrilled by the cosmic order and sacred power of the city, they settled down there. Similarly, other gods, planetary divinities, goddesses, demi-gods, assisting divine beings, and divine vehicle-animals in their different forms, all went there and settled down. Only after a cycle of time was completed, Shiva and Pārvati returned home on Vishnu’s appeal and took up residence again in Kāshi. Eventually, Divodāsa himself worshipped Shiva by installing a linga, which was later on known after him as Divodāseshvara. In the course of time the varieties and different groups of goddesses and gods came to support Shiva and to enjoy the sacred power of the city. The story of King Divodāsa goes back to the Vedas and in the course of time was modified in the purānic literature to fit the local traditions and the rulers. In the Vedas a king named Divodāsa is mentioned in association with Indra’s destruction of a hundred cities but it is difficult to accept the same figure as king of Kāshi/Vārānasi. In the Mahābhārata Divodāsa is described who had fortified the city of Vārānasi and also taken away the sacrificial fire of his enemies. This act resulted in conflict with Shiva who wished to dwell there Singh, R. P., Singh, R. S., & Rana, P. S. (2010).
This is where you'll find the well-known Vishwanath Temple. The city's most upmarket
shopping district can be found along the winding gall that leads to the Vishwanath temple. The
central mandi (wholesale grain trade) of Varanasi is located in Visessarganj, which takes its
name from the original Visheshwara shrine. The wholesale market for Banarsi sarees is located
between Vishwanath gali and Visessarganj, and you can also find many more types of arts and
crafts for which Benaras is known. Additionally, all of the ancient bathing ghats and the most
revered Sanskrit pathashalas and mathas may be found within this arca. Thugs, gundas, and
prostitutes coexist here with enlightened pandits, priests, ascetics, men of literature, and artists.
Simply put, this region embodies the spiritual and secular soul of Kashi, the complete character
of this ancient city. There are several distinct cultural enclaves within the pucca mahal, each of
which is dominated by a different language family of Brahmins. So, there are Tamilian,
Kannada, Andhra, Bengali, Maithil, Nepali, Gujarati, and Maharashtrian mohallas. This
culturally diverse area is also home to the occasional Brahmin from Kashmir, Punjab, Sindh,
Rajasthan, or elsewhere. Everywhere in the city, you'll undoubtedly run upon local Brahmins or Brahmins visiting from other regions of Uttar Pradesh. There are Khatris, Agarwals, Ahirs,
Dome, and members of many more castes dispersed around the city. The Kashi population
includes a sizeable number of Buddhists, Jains, and Sikhs. A small but significant number of
Christians can also be found among the Muslims. Varanasi was once the center of spiritual
education. It was called, SarvaVidya ki Rajdhani (the capital of knowledge of everything).
Varanasi developed many scholars, intellects, and others in different fields. Many universities
were built in Varanasi, in the past Vidyarthi, L. P., Jha, M., & Saraswati, B. (1979).
The city also thrived in Ayurveda medical education and Panchkarma treatment. Many hospitals were erected and the famous Indian medical book, Sushruta Samhita’s author, Sushruta lived and trained in Varanasi. Varanasi has old culture of fine art and literature. Great Indian writers such as Kabir Das, Ravidas, Tulsidas Kulluka Bhatt, Bharatendu Harishchandra, Jaishankar Prasad, Hazari Prasad Dwivedi, Tegh Ali, Kshetresa Chandra Chattopadhyaya, Acharya Shukla, Munshi Premchand, Vagish Shastri, Baldev Upadhyaya, Sudama Pandey, Jagannath Prasad Ratnakar, Devaki Nandan Khatri and Vidya Niwas Mishra have lived in this city. Varanasi is one of the world's oldest continually inhabited cities. Kashi, its ancient name, was associated with a kingdom of the same name of 2,500 years ago. The Buddha is recorded in the Pali canon to have given his first sermon, "The Setting in Motion of the Wheel of Dharma", at nearby Sarnath in 528 BCE. In the 8th century, Adi Shankara established the worship of Shiva as an official sect of Varanasi. Since ancient times, the city has been an important centre of Hindu devotion, pilgrimage, mysticism and poetry contributing to its cultural importance.
In Varanasi the art lovers and historians such as Rai Krishnadasa, musician Gopal Mishra,
Omkarnath Thakur, Ravi Shankar, Bismillah Khan, Girija Devi, Siddheshwari Devi, Lalmani
Misra, N. Rajam, Rajbhan Singh, Anokhelal Mishra, Samta Prasad, Kanthe Maharaj, M. V.
Kalvint, Sitara Devi, Gopi Krishna, Kishan Maharaj, Vikash Maharaj, Rajan, Sajan Mishra,
Mahadev Mishra, Chhannulal Mishra and numerous others who have kept this city alive to the
spiritual aspects of fine arts. People celebrate their numerous festivals in traditional styles of
classical and folk culture of Varanasi. Varanasi has the unique art culture all across the world,
because of its richest cultural traditions it is called as the cultural capital of India. It has become
the center of the Indian culture as it belongs to the amalgamation of archaeology, traditions,
natural features, religious places, various religions, sculpture and old history. Ancient arts and
cultures are still preserved in the Varanasi city in many museums which denotes the ancient art
and culture of the people. It place indicates that the  people here do not  forget the old culture but follow them.  Religious places, museums and monuments say the real history of the Varanasi city, generally known as the Kashi. Varanasi is famous worldwide for its art culture such as the silk and Banarasi Sarees, handicrafts, ornaments,metal work, textiles, clay, woodwork and many more Jamal, S., & Sen, P. A. (2022).
Varanasi has the variety of educational institutions that’s why it has become the center of education for all the religions worldwide. It was considered the capital of education because of its great contribution towards the education. Indian classical music, drama and other activities are closely associated with the great culture of the Varanasi. It is the birth place of great legends who has provided their immense contribution in developing the city. The fairs, melas and cultural gatherings present a different life in Kashi. From attending Ganga Aarti to Ramlila dramas, everything event brings the people together.
Dhrupad Mela is an annual music festival held in Varanasi, India. It features performances in the dhrupad tradition of Indian classical music. Dhrupad Mela is a five-day musical festival devoted to dhrupad style held at Tulsi Ghat in February–March. Since 1923, the temple has organised a five-day classical music and dance concert festival named Sankat Mochan Sangeet Samaroh. Sankat Mochan Sangeet Samaroh is an annual music festival held at the Sankat Mochan. Hanuman Temple in Varanasi, India. It features performances in Indian classical music and dance. Historically, Varanasi has been a centre for education in India, attracting students and scholars from across the country. Varanasi has an overall literacy rate of 80% (male literacy:85%, female literacy: 75%). Basketball, cricket, and field hockey are popular sports in Varanasi.The main stadium in the city is the Dr Sampurnanda Stadium (Sigra Stadium), were first-class cricket matches are held.
Conclusion
The study here presented Kashi’s history, and elaborated on its cultural and civilizational evolution. Varanasi, formerly called Kashi, is one of the world's oldest cities. Similarly, this analysis defines the cultural pursuits, civilizations, educational institutions, and religious institutions that make up Kashi. Kashi khanda's cultural history is also a part of the study work.
References
1. Chandramouli, K.: Luminous Kashi to VibrantVaransi, Varansi Indica Book, Varanasi, 
2006.
2. Sukul K.N: Varanasi down the Ages, Varansi Bhargava Bhashan Prakshan, Patna, 1974
3. Tripathi, B. D. Ambasht, R. S. and Sikandar, M. (1984) Ecological Investigation on the 
Plant Biomass and Energy Used for the Burning of Human Dead Bodies at Varanasi 
Ghats. River Ecology and Human Health, National Environmental Conservation 
Association- Varanasi, pp. 62-69, Accessed on 29 January 2022.
4. Vidyarthi, L. P., Jha, M., & Saraswati, B. (1979). The sacred complex of Kashi: a 
microcosm of Indian civilization. Concept Publishing Company.
5. Jamal, S., & Sen, P. A. (2022). The River of Life, Death, Livelihood and Pilgrimage: An 
Assessment of Ganges in Varanasi, Uttar Pradesh.
6. Singh, R. P., Singh, R. S., & Rana, P. S. (2010). Hindu goddesses in Kāshi: spatial 
patterns and symbolic orders. Sacred Geography of Goddesses in South Asia: Essays in 
Memory of David Kinsley. Newcastle upon Tyne: Cambridge Scholars Publishing, 249-
306.
7. https://www.bhaskar.com/news/UP-VAR-rangbhari-ekadashi-celebrated-in-kashivishwanath-temple-varanasi-news-hindi-5546329-PHO.html
8. "Kashi Vishwanath Dham project: 13 building owners refuse to sell property | Varanasi 
News - Times of India"
9. Karkar, S.C. (2009). The Top Ten Temple Towns of India. Kolkota: Mark Age 
Publication.
10. "Yadav Bandhus Perform Jalabhishek of Lord Shiva". The Times of India. 19 July 2022. Retrieved 20 July 2022
